LoadTesting/testing.yaml
config:
  target: http://localhost:8182/v1
  phases:
    - duration: 1
      arrivalRate: 1
scenarios:
  - flow:
      - get:
          url: '/products'
          expect:
            - statusCode: 200

      - post:
          url: '/products'
          json:
            name: 'artillery - Test Nome'
            description: 'artillery - Test Descrição'
            sku: 'artillery - Test sku'
            category_id: 'artillery - Test Categoria'
            price: 1.25
          expect:
            - statusCode: 201